cf/Catalogs/нсиКлассификаторПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>нсиКлассификаторПродукции</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Методолог</Name>
					<Comment>Методолог класса</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эксперт</Name>
					<Comment>Эксперт  класса</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НулеваяГруппировка</Name>
					<Comment>Признак нулевой группировки из ОКП</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Свободный комментарий к классу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Полное классификационное описание класса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассНеВключает</Name>
					<Comment>Описание не включаемых в класс объектов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассВключает</Name>
					<Comment>Описание включаемых в класс объектов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоМакет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиШаблоновНаименований</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЭлемента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.нсиТипыЭлементовНаименования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементНаименования</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.нсиХарактеристикиМТР</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрефиксЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПостфиксЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/ChartsOfCharacteristicTypes/нсиХарактеристикиМТР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>нсиХарактеристикиМТР</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.нсиУниверсальныйФункциональныйСправочник</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.нсиУниверсальныйКлассификатор</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>16</v8:Digits>
					<v8:FractionDigits>4</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>150</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиКлассификаторПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПоКлассификатору</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.нсиНаименованияХарактеристикМТР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗависитОтПроизводителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СклоненияПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьОбязательно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

cf/Catalogs/нсиКлассификаторПродукции/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура копирует характеристики МТР из класса ПредметОригинал, копирует шаблон наименования.
// Параметры:
//	ПредметОригинал - ссылка на класс, с которого копируются характеристики.
//
Процедура СкопироватьХарактеристикиОригинала(ПредметОригинал) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	нсиХарактеристикиМТР.Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.нсиХарактеристикиМТР КАК нсиХарактеристикиМТР
		|ГДЕ
		|	нсиХарактеристикиМТР.Класс = &ПредметОригинал";
	
	Запрос.УстановитьПараметр("ПредметОригинал", ПредметОригинал);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Копия характеристики.
		НоваяХарактеристика = ПланыВидовХарактеристик.нсиХарактеристикиМТР.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НоваяХарактеристика, Выборка.Ссылка,, "Код,Класс,Родитель");
		НоваяХарактеристика.УстановитьНовыйКод();
		Если ЭтоНовый() тогда
			НоваяХарактеристика.Класс = ПолучитьСсылкуНового();
		Иначе 	
			НоваяХарактеристика.Класс = Ссылка;
		КонецЕсли;
		НоваяХарактеристика.Записать();
		
		// Замена характеристик в шаблонах наименований.
		НайденыеСтроки = НастройкиШаблоновНаименований.НайтиСтроки(Новый Структура("ЭлементНаименования", Выборка.Ссылка));
		Для Каждого НайденнаяСтрока Из НайденыеСтроки цикл
			НайденнаяСтрока.ЭлементНаименования = НоваяХарактеристика.Ссылка;
		КонецЦикла;	
	КонецЦикла;
		
КонецПроцедуры	

// Процедура копирует или изменяет характеристки текущего класса из класса ПредметМакет.
// Параметры:
//	ПредметМакет - ссылка на класс - источник характеристик.
//
Процедура ОбновитьХарактеристикиПоМакету(ПредметМакет) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	нсиХарактеристикиМТРМакет.Ссылка КАК Макет,
		|	нсиХарактеристикиМТРОригинал.Ссылка КАК Оригинал,
		|	нсиХарактеристикиМТРОригинал.ПометкаУдаления КАК Порядок
		|ИЗ
		|	ПланВидовХарактеристик.нсиХарактеристикиМТР КАК нсиХарактеристикиМТРМакет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.нсиХарактеристикиМТР КАК нсиХарактеристикиМТРОригинал
		|		ПО нсиХарактеристикиМТРМакет.НаименованиеПоКлассификатору = нсиХарактеристикиМТРОригинал.НаименованиеПоКлассификатору
		|			И (нсиХарактеристикиМТРОригинал.Класс = &ПредметОригинал)
		|ГДЕ
		|	нсиХарактеристикиМТРМакет.Класс = &ПредметМакет
		|
		|УПОРЯДОЧИТЬ ПО
		|	Макет,
		|	Порядок
		|ИТОГИ ПО
		|	Макет";
	
	Запрос.УстановитьПараметр("ПредметМакет", ПредметМакет);
	Запрос.УстановитьПараметр("ПредметОригинал", Ссылка);
	
	ВыборкаМакет = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаМакет.Следующий() Цикл
		
		ВыборкаОригинал = ВыборкаМакет.Выбрать();
		Если ВыборкаОригинал.Следующий() Тогда 
			
			Если ВыборкаОригинал.Оригинал = NULL тогда
				ХарактеристикаОбъект = ПланыВидовХарактеристик.нсиХарактеристикиМТР.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(ХарактеристикаОбъект, ВыборкаМакет.Макет,, "Код,Класс,Родитель");
				ХарактеристикаОбъект.УстановитьНовыйКод();
				ХарактеристикаОбъект.Класс = Ссылка;
			Иначе 
				ХарактеристикаОбъект = ВыборкаОригинал.Оригинал.ПолучитьОбъект();
				ЗаполнитьЗначенияСвойств(ХарактеристикаОбъект, ВыборкаМакет.Макет,, "Код,Класс,Родитель");
			КонецЕсли;
			
			ХарактеристикаОбъект.Записать();
			
			// Замена характеристик в шаблонах наименований.
			НайденыеСтроки = НастройкиШаблоновНаименований.НайтиСтроки(Новый Структура("ЭлементНаименования", ВыборкаМакет.Макет));
			Для Каждого НайденнаяСтрока Из НайденыеСтроки цикл
				НайденнаяСтрока.ЭлементНаименования = ХарактеристикаОбъект.Ссылка;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

// Процедура удаляет характеристики объекта, если это макет.
//
Процедура УдалитьХарактеристики() Экспорт
	
	Если Не ЭтоМакет тогда
		Возврат
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	нсиХарактеристикиМТР.Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.нсиХарактеристикиМТР КАК нсиХарактеристикиМТР
		|ГДЕ
		|	нсиХарактеристикиМТР.Класс = &Предмет";
	
	Запрос.УстановитьПараметр("Предмет", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбъектДляУдаления = Выборка.Ссылка.ПолучитьОбъект();	
		ОбъектДляУдаления.ОбменДанными.Загрузка = Истина;
		ОбъектДляУдаления.Удалить();
	КонецЦикла;
		
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.нсиКлассификаторПродукции") Тогда
		
		// заполнение реквизитов
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "Владелец,Код,ЭтоМакет");
		
		// заполнение табличных частей
		НастройкиШаблоновНаименований.Загрузить(ДанныеЗаполнения.НастройкиШаблоновНаименований.Выгрузить());
		
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЭтоМакет тогда
		ДополнительныеСвойства.Вставить("СШПНеобрабатывать", Истина); 
	КонецЕсли;	
	                                                                    
	нсиОбщегоНазначения.УдалитьПробелыИзСтроки(Наименование);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
